6. Получить информацию о книгах, выпущенных после 2000 года

SELECT 
    Книги.Название AS НазваниеКниги,
    Авторы.Имя + ' ' + Авторы.Фамилия AS Автор,
    Книги.ГодИздания
FROM 
    Книги
JOIN 
    Авторы ON Книги.AuthorID = Авторы.AuthorID
WHERE 
    Книги.ГодИздания > 2000;

. Получить список книг, которые были выданы, но ещё не возвращены

SELECT 
    Члены.Имя + ' ' + Члены.Фамилия AS ЧленБиблиотеки,
    Книги.Название AS НазваниеКниги,
    Выдачи.ДатаВыдачи
FROM 
    Выдачи
JOIN 
    Члены ON Выдачи.MemberID = Члены.MemberID
JOIN 
    Книги ON Выдачи.BookID = Книги.BookID
WHERE 
    Выдачи.ДатаВозврата IS NULL; -- Предполагаем, что NULL означает, что книга не возвращена
